work-specific/customer-release-testing/sltp/test_3.26.3-PON_DIAGNOSTICS_DATA.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.realtime.dslo.assia.com" xmlns:xsd="http://api.realtime.dslo.assia.com/xsd" xmlns:xsd1="http://model.napi.dslo.assia.com/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:submitRequest>
         <impl:request>
            <xsd:entityID>#line_id#</xsd:entityID>
            <xsd:requestType>PON_DIAGNOSTICS_DATA</xsd:requestType>
            <xsd:additionalParameters>
               <xsd1:type>realtime.dc.data.type</xsd1:type>
               <xsd1:value>ALL,POP_O,POP_P,ALARM_CURRENT</xsd1:value>
            </xsd:additionalParameters>
         </impl:request>
         <impl:timeout>100000</impl:timeout>
      </impl:submitRequest>
   </soapenv:Body>
</soapenv:Envelope>
